/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: iyildiz <yildiz.ie58@gmail.com>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/07/07 20:10:29 by iyildiz           #+#    #+#             */
/*   Updated: 2023/07/07 20:10:29 by iyildiz          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

size_t ft_strlen(const char *str)
{
    /*
    stringin uzunluğunu döndürür.
    */
    int i;
    i = 0;

    while (str[i] != '\0')
    {
        i++;
    }
    return (i);
}
